---
title: PathOfTravelCalculationServerIds
classe: Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServerIds
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 1
---

# PathOfTravelCalculationServerIds

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Guid DefaultPathOfTravelCalculationGUID { get; }` | `PathOfTravelCalculationServerIds.DefaultPathOfTravelCalculationGUID` | Guid |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```